{"sha":"\"47e7bc67f932866e4467f7ab8a23bb167405bebd\"","commit":{"author":{"name":"\"Nicolas Silva\"","email":"\"nsilva@mozilla.com\"","date":"\"2016-09-01T15:51:09+02:00\""},"committer":{"name":"\"Nicolas Silva\"","email":"\"nsilva@mozilla.com\"","date":"\"2016-09-01T15:51:09+02:00\""},"message":"\"Bug 1298345 - Refactor CanvasRenderingContext2D's texture allocation code. r=Basa5f9dbc\""},"diff":"\"a5f9dbc Bug 236613: change to MPL/LGPL/GPL tri-license.\\ndiff --git a/widget/src/os2/nsGfxDefs.h b/widget/src/os2/nsGfxDefs.h\\nindex 4745029..196d193 100644\\n--- a/widget/src/os2/nsGfxDefs.h\\n+++ b/widget/src/os2/nsGfxDefs.h\\n@@ -1,23 +1,38 @@\\n-/*\\n- * The contents of this file are subject to the Mozilla Public License\\n- * Version 1.1 (the \\\"License\\\"); you may not use this file except in\\n- * compliance with the License. You may obtain a copy of the License at\\n+/* ***** BEGIN LICENSE BLOCK *****\\n+ * Version: MPL 1.1/GPL 2.0/LGPL 2.1\\n+ *\\n+ * The contents of this file are subject to the Mozilla Public License Version\\n+ * 1.1 (the \\\"License\\\"); you may not use this file except in compliance with\\n+ * the License. You may obtain a copy of the License at\\n  * http://www.mozilla.org/MPL/\\n  *\\n- * Software distributed under the License is distributed on an \\\"AS IS\\\"\\n- * basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the\\n- * License for the specific language governing rights and limitations\\n- * under the License.\\n+ * Software distributed under the License is distributed on an \\\"AS IS\\\" basis,\\n+ * WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License\\n+ * for the specific language governing rights and limitations under the\\n+ * License.\\n  *\\n  * The Original Code is the Mozilla OS/2 libraries.\\n  *\\n- * The Initial Developer of the Original Code is John Fairhurst,\\n- * <john_fairhurst@iname.com>.  Portions created by John Fairhurst are\\n- * Copyright (C) 1999 John Fairhurst. All Rights Reserved.\\n+ * The Initial Developer of the Original Code is\\n+ * John Fairhurst, <john_fairhurst@iname.com>.\\n+ * Portions created by the Initial Developer are Copyright (C) 1999\\n+ * the Initial Developer. All Rights Reserved.\\n+ *\\n+ * Contributor(s):\\n  *\\n- * Contributor(s): \\n+ * Alternatively, the contents of this file may be used under the terms of\\n+ * either of the GNU General Public License Version 2 or later (the \\\"GPL\\\"),\\n+ * or the GNU Lesser General Public License Version 2.1 or later (the \\\"LGPL\\\"),\\n+ * in which case the provisions of the GPL or the LGPL are applicable instead\\n+ * of those above. If you wish to allow use of your version of this file only\\n+ * under the terms of either the GPL or the LGPL, and not to allow others to\\n+ * use your version of this file under the terms of the MPL, indicate your\\n+ * decision by deleting the provisions above and replace them with the notice\\n+ * and other provisions required by the GPL or the LGPL. If you do not delete\\n+ * the provisions above, a recipient may use your version of this file under\\n+ * the terms of any one of the MPL, the GPL or the LGPL.\\n  *\\n- */\\n+ * ***** END LICENSE BLOCK ***** */\\n \\n #ifndef _nsgfxdefs_h\\n #define _nsgfxdefs_h\\n\""}